{"name":"Bryan JJ Buckley","goes_by":["JJ","Bryan"],"tagline":"Full-stack Internet Builder","headline":"Looking for an interesting senior software-development position in a forward-thinking Berlin or remote team using Go, Ruby, Elixir, Javascript or Python.\n","date_of_birth":"1978-10-24","email":"jj@bjjb.org","phone":"+49 176 49805866","nationality":"Irish","spoken_languages":["English","German","Irish","Spanish"],"computer_languages":["Ruby","CoffeeScript","Javascript","SASS","HAML","HTML","CSS","Python","Java","C","Lisp","Elixir","Ada","Lua","C++","SQL"],"education":[{"qualification":"BSc in Software Development and Computer Networks","institution":"CIT (Cork Institute of Technology)"},{"qualification":"CCNA (Cisco Certified Network Associate)","institution":"Cisco Networking Academy"}],"experience":[{"company":"Dialogic","from":"2001","to":"2007","position":["Intern","Software Developer","Senior Software Engineer"],"overview":"Dialogic (formerly Eicon Networks) are a global manufacturer of ISDN and\nDSL hardware. After doing my work experience there as part of the BSc in\nSoftware Development and Computer Networks, I was hired as a software\nengineer for the embedded team.  There I worked primarily on protocol\nstacks for the various firmwares (always in C). After some time, I moved\nonto developing Windows drivers in C++. I discovered first Python and then\nRuby whilst looking for a solution to improve the build system for a newly\nacquired line of ISDN modems and their driver packages. I later had the\nopportunity to write an early Rails application which generates\ncertificates for enabling driver features in the Eicon telephony hardware\nrange. Thus encouraged, I decided to work on Rails full-time.\n","website":"http://www.eiconworks.com","id":"eicon"},{"company":"Travel IQ","position":["Senior Software Developer","Architect"],"title":"Travel IQ","from":"2007","to":"2009","overview":"Travel IQ was my first experience with a start-up, and it brought me to\nBerlin. In 2006, after a telephone interview with the CTO, I was asked to\ncome to Berlin to meet the team of the fledgeling startup. I moved to\nFriedrichshain in February 2007, and worked with Mathias and 4 part-time\nstudents to get the app online for August 1st. After the launch, as senior\ndeveloper/architect in an expanding team, we set about re-writing the\nplatform for Rails 2. In October 2008, version 2 was live, and in 2009,\nthe company was aquired by Check24.  Mission accomplished, I left to\ntravel.\n","website":"http://www.testberichte.de/p/traveliq-de-tests/flugpreisvergleich-testbericht.html","id":"tiq"},{"company":"eBay","from":"2010","to":"2016","position":["IT Consultant","Software Solutions Vendor"],"overview":"In between travels, I've done some project work for eBay GmbH in\nDreilinden.  I've whipped together a gem for using the eBay Trading API,\nand have built a couple of Rails apps (one in Rails 2.3, and a more recent\none Rails 3.2) which are used for ranking signed-up users by their eBay\ntrading data. The apps are used internally by eBay to encourage customer\nengagement, and to push particular verticals as needed. Other work\nincludes a HTML5 photo-gallery (my first introduction to CarrierWave), and\na mobile front-end to the eBay Open Global Competition app. As this is\nlikely to continue, I spend some spare time improving the eBay Open JSON\nAPI, and the open-source eBayR gem.\n","website":"http://ebay.com","links":["http://github.com/jjbuckley/ebayr"],"id":"ebay"},{"company":"SAP","position":["Software Solutions Vendor"],"from":"2014","to":"2014","overview":"I was contracted by SAP to build an internal application, to manage their\nsecurity division's penetration tests every year. The app is mostly a\nstraightforward PostgreSQL backed RoR application, with incrementally more\ndetailed views for increasing levels of user responsibility, with\nfacilities to import data from Excel spreadsheets, and to generate PDF\nreports. The app is continuously deployed in a docker container upon SAP's\ninternal PaaS system.\n","website":"http://sap.com","id":"sap"},{"company":"DaWanda","position":["Software Consultant"],"from":"2012","to":"2014","overview":"For DaWanda, I was the senior consultant on several of their projects, the\nlargest and most challenging of which were the rearchitcture of their\nbackend system (to an elastic, zero-downtime distributed VS cluster), and\nthe overhaul of their UI to a mobile-first, responsive layout for all\nuser-facing pages. I returned in 2014 to provide a Sinatra replacement for\ntheir core legacy Rails app for their API services. In between were\nseveral short projects, including improving their image-uploading\nservices, remodelling some of their MySQL database, and designing and\ncoding miscellaneous APIs and gems for their consumption.\n","website":"http://dawanda.com","id":"dawanda"},{"company":"TrainMySelf","position":["CTO"],"from":"2011","to":"2015","overview":"TrainMySelf GmbH was a company founded in 2011 by three guys from South\nTyrol and me (as CTO and lead - sometimes only - developer). The idea was\nto produce an iPhone and Android app that delivers customized training\nplans to marathon runners. Over its latter years, we hired a couple of\nadditional developers part-time and graphic designers, and it grew to more\nof an app-platform - with an administration interface to allow\ncustomization of the mobile apps, and a delivery system for PhoneGap\napplications, all powered by a JSON API which generates the training plans\n(in three languages). TrainMySelf GmbH was disbanded in 2015, after\nshifting the focus of the platform to health and recuperation apps. I took\nthe opportunity thereafter to travel around the Americas for a year.\n","id":"tms","website":"https://trainmyself.com"},{"company":"Movinga","position":["Software Consultant"],"from":"2016","to":"2017","overview":"I joined Movinga in February 2016 just as they were looking to replace\ntheir entire PHP stack with something shinier. Along with the V.P. of\nproduct and the global head of engineering, we designed and prototyped a\nscalable and comprehensive platform to integrate Salesforce, various\npayment providers, logistics, intelligent pricing, and an ops admin\ninterface into a coherent and maintainable software stack.\nAs part of this reboot, as well as leading early development, I was\ninvolved in the co-ordination of outsourced programming talent, hiring\nin-house, training up existing PHP developers to work with Rails, and\nfostering a tech-driven culture of balanced teams as the company grew\nrapidly. Over the course of the year, we expanded the team from 2 Ruby\ndevelopers to over 30, and built a fully cloud-native micro-services\narchitecture, with complete automated test coverage and a CI/CD pipeline\nbased around Docker, Git and the GitLab CI runner.\n","website":"https://movinga.com","id":"movinga"},{"company":"B.J.J.Buckley I.T. Consultancy","position":["Chief Consultant"],"from":"2010","to":"present","overview":"Between long-term projects, I like to keep busy in a wide range of areas -\ncreating toy mobile apps, making and running websites for small\nbusinesses, working on numerous open-source projects, evaluating and\nadvising on network technology or software stacks, etc. As this kind of\ngeneral consultant, I am free to expand my skillset outside of narrow\nspecialisations, while delivering solutions to those who need weird and\nwonderful things.\n","website":"https://bjjbuckley.com","id":"bjjbuckley"}],"hobbies":["Guitar playing","Travelling","Karate","Football (soccer, rugby or GAA)","Learning new things"],"links":[{"name":"Google+","href":"https://plus.google.com/115358926435312925527","id":"google"},{"name":"Twitter feed","href":"http://twitter.com/#!/bjjbuckley","id":"twitter"},{"name":"GitHub Profile","href":"https://github.com/bjjb","id":"github"},{"name":"BitBucket Profile","href":"https://bitbucket.org/bjjb","id":"bitbucket"},{"name":"GitLab Profile","href":"https://gitlab.com/bjjb","id":"gitlab"},{"name":"Rubygems Profile","href":"https://rubygems.org/profiles/bjjb","id":"rubygems"},{"name":"NPM profile","href":"https://www.npmjs.com/~bjjb","id":"npm"}],"other_formats":["yml","txt","json","xml","html","pdf"]}