{"name":"Bryan JJ Buckley","goes_by":["JJ","Bryan"],"tagline":"Full-stack Architect and Coder","headline":"Looking for an interesting senior software-development position in a forward-thinking Berlin team using either NodeJS or Ruby on Rails.\n","date_of_birth":"1978-10-24","email":"jjbuckley@gmail.com","phone":"+49 176 49805866","nationality":"Irish","spoken_languages":["English","German","Irish","Spanish"],"computer_languages":["Ruby","CoffeeScript","SASS","HAML","Javascript","HTML","CSS","Python","C","Lisp","Ada","Lua","C++","SQL"],"education":[{"qualification":"BSc in Software Development and Computer Networks","institution":"CIT (Cork Institute of Technology)"},{"qualification":"CCNA (Cisco Certified Network Associate)","institution":"Cisco Networking Academy"}],"experience":[{"company":"Dialogic","from":"2001","to":"2007","position":["Intern","Software Developer","Senior Software Engineer"],"overview":"Dialogic (formerly Eicon Networks) are a global manufacturer of ISDN and DSL\nhardware. After doing my work experience there as part of the BSc in\nSoftware Development and Computer Networks, I was hired as a software engineer\nfor the embedded team.  There I worked primarily on protocol stacks for the\nvarious firmwares (always in C). After some time, I moved onto developing\nWindows drivers in C++. I discovered first Python and then Ruby whilst looking\nfor a solution to improve the build system for a newly acquired line of ISDN\nmodems and their driver packages. I later had the opportunity to write an early\nRails application which generates certificates for enabling driver features in\nEicon's entire telephony range. Thus encouraged, I decided to work on Rails\nfull-time.\n","website":"http://www.eiconworks.com","id":"eicon"},{"company":"Travel IQ","position":["Senior Software Developer","Architect"],"title":"Travel IQ","from":"2007","to":"2009","overview":"Travel IQ was my first experience with a start-up, and it brought me to\nBerlin. In 2006, after a telephone interview with the CTO, I was asked to come\nto Berlin to meet the team of the fledgeling startup. I moved to Friedrichshain\nin February 2007, and worked with Mathias and 4 part-time students to get the\napp online for August 1st. After the launch, as senior developer/architect in an\nexpanding team, we set about re-writing the platform for Rails 2. In October\n2008, version 2 was live, and in 2009, the company was aquired by Check24.\nMission accomplished, I left to travel.\n","website":"http://travel-iq.de","id":"tiq"},{"company":"eBay","from":"2010","to":"2016","position":["IT Consultant","Software Solutions Vendor"],"overview":"In between travels, I've done some project work for eBay GmbH in Dreilinden.\nI've whipped together a gem for using the eBay Trading API, and have built a\ncouple of Rails apps (one in Rails 2.3, and a more recent one Rails 3.2) which\nare used for ranking signed-up users by their eBay trading data. The apps are\nused internally by eBay to encourage customer engagement, and to push particular\nverticals as needed. Other work includes a HTML5 photo-gallery (my first\nintroduction to CarrierWave), and a mobile front-end to the eBay Open\nGlobal Competition app. As this is likely to continue, I spend some spare time\nimproving the eBay Open JSON API, and the open-source eBayR gem.\n","website":"http://ebay.com","links":["http://deutschland-index.com","http://pm.bjjbuckley.com","http://github.com/jjbuckley/ebayr"],"id":"ebay"},{"company":"SAP","position":["Software Solutions Vendor"],"from":"2014","to":"2014","overview":"I was contracted by SAP to build an internal application, to manage their\nsecurity division's penetration tests every year. The app is mostly a\nstraightforward PostgreSQL backed RoR application, with incrementally more\ndetailed views for increasing levels of user responsibility, with\nfacilities to import data from Excel spreadsheets, and to generate PDF\nreports. The app is continuously deployed in a docker container upon SAP's\ninternal PaaS system.\n","website":"http://sap.com","id":"sap"},{"company":"DaWanda","position":["Software Consultant"],"from":"2012","to":"2014","overview":"For DaWanda, I was the senior consultant on several of their projects, the\nlargest and most challenging of which were the rearchitcture of their\nbackend system (to an elastic, zero-downtime distributed VS cluster), and\nthe overhaul of their UI to a mobile-first, responsive layout for all\nuser-facing pages. I returned in 2014 to provide a Sinatra replacement for\ntheir core legacy Rails app for their API services. In between were\nseveral short projects, including improving their image-uploading\nservices, remodelling some of their MySQL database, and designing and\ncoding miscellaneous APIs and gems for their consumption.\n","website":"http://dawanda.com","id":"dawanda"},{"company":"TrainMySelf","position":["CTO"],"from":"2011","to":"2016","overview":"TrainMySelf GmbH is a company founded in 2011 by three guys from South Tyrol\nand me (as CTO and lead - sometimes only - developer). The idea was to\nproduce an iPhone and Android app that delivers customized training plans to\nmarathon runners. Over the last year, we've hired a couple of additional\ndevelopers part-time and graphic designers, and it's grown to more of an\napp-platform - with an administration interface to allow customization of\nthe mobile apps, and a delivery system for PhoneGap applications, all\npowered by a JSON API which generates the training plans (in three\nlanguages). TrainMySelf is due to be in beta in early June, at which point I\nwill be ready to devote the bulk of my energy to another exciting project.\n","website":"http://trainmyself.com","links":["http://blog.trainmyself.com"],"id":"tms"}],"hobbies":["Guitar playing","Travelling","Karate","Football (soccer, rugby or GAA)","Learning new things"],"links":[{"name":"GitHub Profile","href":"http://github.com/jjbuckley","id":"github"},{"name":"Blog (when I blog)","href":"http://blog.bjjb.org","id":"tumblr"},{"name":"Google+","href":"https://plus.google.com/115358926435312925527","id":"google"},{"name":"Twitter feed","href":"http://twitter.com/#!/bjjbuckley","id":"twitter"}],"other_formats":["yml","txt","json","xml","html"]}